In [88]:
import pandas as pd
df = pd.read_csv("company.csv")

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148 entries, 0 to 147
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Company  140 non-null    object
 1   Age      130 non-null    float64
 2   Salary   124 non-null    float64
 3   Place    134 non-null    object
 4   Country  148 non-null    object
 5   Gender   148 non-null    int64
dtypes: float64(2), int64(1), object(3)
memory usage: 7.1+ KB

In [7]:
df.shape

(148, 6)

In [8]:
df.columns

Index(['Company', 'Age', 'Salary', 'Place', 'Country', 'Gender'], dtype='object')

In [20]:
df.head(12)

    Company   Age  Salary     Place Country  Gender
0       TCS  20.0     NaN   Chennai   India       0
1   Infosys  30.0     NaN    Mumbai   India       0
2       TCS  35.0  2300.0  Calcutta   India       0
3   Infosys  40.0  3000.0     Delhi   India       0
4       TCS  23.0  4000.0    Mumbai   India       0
5   Infosys   NaN  5000.0  Calcutta   India       0
6       TCS   NaN  6000.0   Chennai   India       1
7   Infosys  23.0  7000.0    Mumbai   India       1
8       TCS  34.0  8000.0  Calcutta   India       1
9       CTS  45.0  9000.0     Delhi   India       0
10      CTS  23.0     NaN    Mumbai   India       0
11      CTS  34.0  1089.0  Calcutta   India       0

In [39]:
df.head()

   Company   Age  Salary     Place Country  Gender
0      TCS  20.0     NaN   Chennai   India       0
1  Infosys  30.0     NaN    Mumbai   India       0
2      TCS  35.0  2300.0  Calcutta   India       0
3  Infosys  40.0  3000.0     Delhi   India       0
4      TCS  23.0  4000.0    Mumbai   India       0

In [10]:
df.tail(9)

             Company   Age  Salary      Place Country  Gender
139       Congnizant  22.0  2934.0      Noida   India       0
140          Infosys  44.0  4034.0  Hyderabad   India       0
141              TCS  33.0  5034.0   Calcutta   India       0
142  Infosys Pvt Lmt  22.0  8202.0     Mumbai   India       0
143              TCS  33.0  9024.0   Calcutta   India       1
144          Infosys  22.0  8787.0   Calcutta   India       1
145          Infosys  44.0  4034.0      Delhi   India       1
146              TCS  33.0  5034.0     Mumbai   India       1
147          Infosys  22.0  8202.0     Cochin   India       0

In [13]:
df.shape[1]

6

In [24]:
df.describe() .T

,count,mean,std,min,25%,50%,75%,max
Age,130.0,30.484615,11.096640,0.0,22.0,32.5,37.75,54.0
Salary,124.0,5312.467742,2573.764683,1089.0,3030.0,5000.0,8000.00,9876.0
Gender,148.0,0.222973,0.417654,0.0,0.0,0.0,0.00,1.0

In [29]:
df.Place.unique()

array(['Chennai', 'Mumbai', 'Calcutta', 'Delhi', 'Podicherry', 'Cochin',
       nan, 'Noida', 'Hyderabad', 'Bhopal', 'Nagpur', 'Pune'],
      dtype=object)

In [34]:
df.loc[20:22,["Country","Place"]]

   Country     Place
20   India  Calcutta
21   India     Delhi
22   India    Mumbai

In [54]:
df.iloc[20:22,2:4]

    Salary     Place
20  3045.0  Calcutta
21  3184.0     Delhi

In [52]:
df.loc[13:17,["Place","Country","Gender"]]

         Place Country  Gender
13      Mumbai   India       0
14    Calcutta   India       0
15       Delhi   India       0
16  Podicherry   India       0
17      Cochin   India       0

In [60]:
df.loc[13:17,["Place","Country","Gender"]]

         Place Country  Gender
13      Mumbai   India       0
14    Calcutta   India       0
15       Delhi   India       0
16  Podicherry   India       0
17    new york   India       0

In [89]:
df.loc[90,"Age"] = "NA"

In [90]:
df.loc[90,"Age"]

'NA'

In [63]:
df.loc[107,"Place"] = "new jersey"

In [64]:
df.loc[107,:]

Company           TCS
Age               0.0
Salary         9024.0
Place      new jersey
Country         India
Gender              1
Name: 107, dtype: object

In [71]:
df.rename(columns={'Company' : 'Organiation'},)

    Organiation   Age  Salary     Place Country  Gender
0           TCS  20.0     NaN   Chennai   India       0
1       Infosys  30.0     NaN    Mumbai   India       0
2           TCS  35.0  2300.0  Calcutta   India       0
3       Infosys  40.0  3000.0     Delhi   India       0
4           TCS  23.0  4000.0    Mumbai   India       0
..          ...   ...     ...       ...     ...     ...
143         TCS  33.0  9024.0  Calcutta   India       1
144     Infosys  22.0  8787.0  Calcutta   India       1
145     Infosys  44.0  4034.0     Delhi   India       1
146         TCS  33.0  5034.0    Mumbai   India       1
147     Infosys  22.0  8202.0    Cochin   India       0

[148 rows x 6 columns]

In [69]:
df.columns

Index(['Organiation', 'Age', 'Salary', 'Place', 'Country', 'Gender'], dtype='object')

In [73]:
df.Age.unique()

array([20., 30., 35., 40., 23., nan, 34., 45., 18., 22., 32., 37., 50.,
       21., 46., 36., 26., 41., 24., 25., 43., 19., 38., 51., 31., 44.,
       33., 17.,  0., 54.])

In [75]:
df.Age.value_counts()

22.0    16
33.0    13
44.0    10
34.0     8
23.0     8
21.0     8
32.0     7
0.0      6
35.0     6
41.0     5
24.0     4
43.0     4
45.0     4
36.0     3
31.0     3
20.0     3
40.0     3
25.0     3
26.0     2
37.0     2
30.0     2
46.0     2
50.0     2
17.0     1
18.0     1
51.0     1
54.0     1
19.0     1
38.0     1
Name: Age, dtype: int64

In [76]:
df.apply(lambda x:print(x.nunique()))

6
29
40
13
1
2

Organiation    None
Age            None
Salary         None
Place          None
Country        None
Gender         None
dtype: object

In [78]:
df.Company.replace({"Tata Consultancy Services":"TCS",
                    "Congnizant":"CTS","Infosys Pvt Lmt":"Infosys"},inplace=True)

AttributeError: 'DataFrame' object has no attribute 'Company'